app/controllers/tweets_controller.rb

  def create
    @tweet = current_user.tweets.new(params[:tweet])
    if @tweet.save
---
INSERT INTO "tweets" ("posted", "created_at", "updated_at", "user_id", "post_on", "status") VALUES(NULL, '2010-04-29 15:43:30', '2010-04-29 15:43:30', 1, '2010-04-30 00:00:00', 'Test')

  def destroy
    @tweet = current_user.tweets.find(params[:id])
    @tweet.destroy
---
SELECT * FROM "tweets" WHERE (((posted is null OR posted = 0) AND ("tweets".user_id = 1)) AND ("tweets".user_id = 1)) ORDER BY post_on asc
DELETE FROM "tweets" WHERE "id" = 1